<?php
return [
    "100" => "请求参数错误",
    "110" => "请求类型错误",
    "111" => "appKey错误",
    "112" => "token错误",
    "113" => "未登录",
    "114" => "手机格式不正确",
    "115" => "邮箱格式不正确",
    "116" => "邮箱已被抢注",
    "117" => "手机已被抢注",
    "118" => "账号未注册",
    "119" => "注册失败",
    "120" => "登录失败",
    "121" => "两次输入的密码不一致",
    "122" => "重置密码失败",
    "123" => "验证码错误",
    "124" => "用户或密码错误",
    "125" => "账号格式不正确",
    "126" => "用户不存在",

    "201" => "下单结算错误",

    "301" => "无操作权限",

    "601" => "无文件导入",
    "602" => "文件没有数据",
    "603" => "模板格式错误",
    "604" => "科目不存在",
    "605" => "角色不存在",

    "621" => "同一区域内该学校已存在",
    "622" => "省市县区不匹配",

    "701" => "会议不存在",
    "702" => "会议不存在或已取消",
    "703" => "不能重复报名",
    "710" => "签到失败-未报名或会议已取消",
    "711" => "签到失败-退款中",
    "712" => "签到失败-已退款",
    "713" => "签到失败-重复签到",
    "714" => "签到失败-未付款",
    "715" => "获取二维码失败",
    "716" => "取消失败-不存在或距离会议小于1天",

    "1001" => "奖品个数不足",
];